function passwdGen() {
    allGeneratedPasswords = "";

    let count2 = document.querySelector("#passwords-count").value;
    if (count2.replace(/\s/g, '').length === 0 || isNaN(count2)) {
        count2 = 20;
        alert("Вы ввели не число, будет сгенерировано 20 паролей.");
    } else {
        if (count2 > 20) {
            count2 = 20;
            alert("Вы указали более 20 паролей так как стоит ограничение, будет сгенерировано 20 паролей.");
        }
    }
    let passwords = document.querySelector('#passwords');
    passwords.innerHTML = "";
    for (n = 0; n < count2; n++) {
        let passwordSymbols = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", 0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
        let specialSymbols = ["!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "-", "_", "+", "=", ";", ":", ",", "/", "?", "\\", "|", "`", "~", "[", "]", "{", "}", "."];
        let count = document.querySelector("#symbols-count").value;
        let passwd = '';

        if (document.querySelector("#special-symbols-setting").checked == true) {
            passwordSymbols = passwordSymbols.concat(specialSymbols);
        }
        if (document.querySelector("#read-password-setting").checked == true) {
            passwordSymbols.splice(passwordSymbols.indexOf("l"), 1);
            passwordSymbols.splice(passwordSymbols.indexOf(0), 1);
            passwordSymbols.splice(passwordSymbols.indexOf("i"), 1);
            passwordSymbols.splice(passwordSymbols.indexOf("o"), 1);
        }
        if (document.querySelector("#pin-code-setting").checked == true) {
            let pinCodeNumbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
            passwordSymbols = pinCodeNumbers
        }

        for (i = 0; i < count; i++) {
            let symbol = passwordSymbols[getRandomIntInclusive(0, passwordSymbols.length - 1)]
            getRandomIntInclusive(1, 2);
            if (typeof symbol == "string") {
                if (getRandomIntInclusive(1, 2) == 1) {
                    symbol = symbol.toUpperCase();
                } else {
                    symbol = symbol.toLowerCase();
                }
            }
            passwd += symbol;
        }
        passwords.innerHTML += '<p>' + passwd + '</p>'
        allGeneratedPasswords += passwd + "\n"
    }
}

function changeSymbolCount() {
    let count = document.querySelector(" #symbols-count").value;
    document.querySelector("#symbols").innerHTML = count;
}

function getRandomIntInclusive(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

function openSettings() {
    element = document.querySelector("#password-settings");
    if (element.style.display == "none") {
        element.style.display = "block";
    } else {
        element.style.display = "none";
    }
}

function downloadFile() {
    var stroka = allGeneratedPasswords;
    var blob = new Blob([stroka], {type: "text/plain"});
    var link = document.createElement("a");
    link.setAttribute("href", URL.createObjectURL(blob));
    link.setAttribute("download", "passwords.txt");
    link.click();
}

function nameGen() {
    let passwords = document.querySelector('#passwords');
    passwords.innerHTML = "";
    let names = ["Абрам", "Аваз", "Аввакум", "Август", "Авдей", "Авраам", "Автандил", "Агап", "Агафон", "Аггей", "Адам", "Адис", "Адольф", "Адриан", "Азамат", "Азарий", "Азат", "Айдар", "Айнур", "Айрат", "Акакий", "Аким", "Алан", "Александр", "Алексей", "Али", "Алихан", "Алмаз", "Альберт", "Альфред", "Амадей", "Амадеус", "Амаяк", "Амин", "Амвросий", "Анатолий", "Анвар", "Ангел", "Андрей", "Андрэ", "Аникита", "Антон", "Ануфрий", "Анфим", "Аполлинарий", "Арам", "Аристарх", "Аркадий", "Арман", "Армен", "Арно", "Арнольд", "Арон", "Арсен", "Арсений", "Арслан", "Артем", "Артемий", "Артур", "Архип", "Аскольд", "Афанасий", "Ахмет", "Ашот", "Бахрам", "Бежен", "Бенедикт", "Берек", "Бернар", "Богдан", "Боголюб", "Бонифаций", "Бореслав", "Борис", "Борислав", "Боян", "Бронислав", "Бруно", "Булат", "Вадим", "Валентин", "Валерий", "Вальдемар", "Вальтер", "Вардан", "Варлаам", "Варфоломей", "Василий", "Ватслав", "Велизар", "Велор", "Венедикт", "Вениамин", "Викентий", "Виктор", "Вилен", "Вилли", "Вильгельм", "Виссарион", "Виталий", "Витаутас", "Витольд", "Владимир", "Владислав", "Владлен", "Влас", "Володар", "Всеволод", "Вячеслав", "Гавриил", "Галактион", "Гамлет", "Гарри", "Гаяс", "Гевор", "Геворг", "Геннадий", "Генри", "Генрих", "Георгий", "Геральд", "Герасим", "Герман", "Глеб", "Гоар", "Гордей", "Гордон", "Горислав", "Градимир", "Григорий", "Гурий", "Густав", "Давид", "Давлат", "Дамир", "Даниил", "Данислав", "Даньяр", "Демид", "Демьян", "Денис", "Джамал", "Джеймс", "Джереми", "Джозеф", "Джордан", "Джорж", "Дик", "Динар", "Динасий", "Дмитрий", "Добрыня", "Дональд", "Донат", "Донатос", "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсей", "Евстафий", "Егор", "Елизар", "Елисей", "Емельян", "Еремей", "Ермолай", "Ерофей", "Ефим", "Ефрем", "Жан", "Ждан", "Жерар", "Закир", "Замир", "Заур", "Захар", "Зенон", "Зигмунд", "Зиновий", "Зураб", "Ибрагим", "Иван", "Игнат", "Игнатий", "Игорь", "Иероним", "Измаил", "Израиль", "Илиан", "Илларион", "Ильхам", "Ильшат", "Илья", "Ильяс", "Инокентий", "Иоанн", "Иоаким", "Ион", "Иосиф", "Ипполит", "Ираклий", "Иса", "Исаак", "Исидор", "Искандер", "Ислам", "Исмаил", "Казбек", "Казимир", "Камиль", "Карен", "Карим", "Карл", "Ким", "Кир", "Кирилл", "Клавдий", "Клаус", "Клим", "Климент", "Клод", "Кондрат", "Константин", "Корней", "Корнилий", "Кузьма", "Лавр", "Лаврентий", "Лазарь", "Лев", "Леван", "Левон", "Ленар", "Леон", "Леонард", "Леонид", "Леонтий", "Леопольд", "Лука", "Лукьян", "Любим", "Любомир", "Людвиг", "Люсьен", "Люций", "Мавлюда", "Мадлен", "Май", "Майкл", "Макар", "Макарий", "Максим", "Максимильян", "Максуд", "Мансур", "Мануил", "Мар", "Марат", "Мариан", "Марк", "Марсель", "Мартин", "Матвей", "Махмуд", "Мераб", "Мефодий", "Мечеслав", "Микула", "Милан", "Мирон", "Мирослав", "Митрофан", "Михаил", "Мишлов", "Модест", "Моисей", "Мстислав", "Мурат", "Муслим", "Мухаммед", "Назар", "Назарий", "Наиль", "Натан", "Наум", "Нестор", "Никанор", "Никита", "Никифор", "Никодим", "Никола", "Николай", "Никон", "Нильс", "Нисон", "Нифонт", "Норманн", "Овидий", "Олан", "Олег", "Олесь", "Онисим", "Орест", "Орландо", "Осип", "Оскар", "Остап", "Павел", "Панкрат", "Парамон", "Петр", "Платон", "Порфирий", "Потап", "Прокофий", "Прохор", "Равиль", "Радий", "Радик", "Радомир", "Радослав", "Разиль", "Райан", "Раймонд", "Раис", "Рамазан", "Рамиз", "Рамиль", "Рамон", "Ранель", "Расим", "Расул", "Ратибор", "Ратмир", "Рафаил", "Рафаэль", "Рафик", "Рашид", "Рем", "Ринат", "Рифат", "Рихард", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам", "Руфин", "Рушан", "Рэй", "Сабир", "Савва", "Савелий", "Самвел", "Самсон", "Самуил", "Святослав", "Севастьян", "Северин", "Семен", "Серафим", "Сергей", "Сидор", "Сократ", "Соломон", "Спартак", "Спиридон", "Стакрат", "Станислав", "Степан", "Стефан", "Стивен", "Стоян", "Султан", "Тагир", "Таис", "Тайлер", "Талик", "Тамаз", "Тамерлан", "Тарас", "Тельман", "Теодор", "Терентий", "Тибор", "Тиграм", "Тигран", "Тигрий", "Тимофей", "Тимур", "Тит", "Тихон", "Томас", "Трифон", "Трофим", "Ульманас", "Умар", "Устин", "Фадей", "Фазиль", "Фанис", "Фарид", "Фархад", "Федор", "Федот", "Феликс", "Феодосий", "Фердинанд", "Фидель", "Филимон", "Филипп", "Флорентий", "Фома", "Франц", "Фред", "Фридрих", "Фуад", "Хабиб", "Хаким", "Харитон", "Христиан", "Христос", "Христофор", "Цезарь", "Чарльз", "Чеслав", "Чингиз", "Шамиль", "Шарль", "Эдвард", "Эдгар", "Эдмунд", "Эдуард", "Эльдар", "Эмиль", "Эмин", "Эммануил", "Эраст", "Эрик", "Эрнест", "Юлиан", "Юлий", "Юнус", "Юрий", "Юхим", "Яков", "Ян", "Януарий", "Ярослав", "Ясон"];
    let surnames = ["Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов", "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов", "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов", "Моисеев", "Елисеев", "Кошелев", "Костин", "Горбачёв", "Орехов", "Ефремов", "Исаев", "Евдокимов", "Калашников", "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов", "Агафонов", "Муравьёв", "Ларионов", "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов", "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев", "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Гришин", "Кононов", "Дементьев", "Ситников", "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов", "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков", "Евсеев", "Лаврентьев", "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков", "Бирюков", "Шарапов", "Никонов", "Щукин", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников", "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков", "Бобылёв", "Доронин", "Белозёров", "Рожков", "Самсонов", "Мясников", "Лихачёв", "Буров", "Сысоев", "Фомичёв", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов", "Субботин", "Фокин", "Блохин", "Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров",];
    let count = 3;
    let passwd = '';
    let whatChapterName = 1;
    for (i = 0; i < count; i++) {
        let symbol = "";
        if (whatChapterName == 1) {
            symbol = names[getRandomIntInclusive(0, names.length - 1)];
        }

        if (whatChapterName == 2) {
            symbol = surnames[getRandomIntInclusive(0, surnames.length - 1)];
        }

        passwd += " " + symbol + " ";
        whatChapterName += 1;
    }
    passwords.innerHTML += '<p>' + passwd + '</p>'
}

function numberGen() {
    let passwd = '';
    let minNumber = 0;
    let maxNumber = 0;
    let minNumberInput = document.querySelector("#min-number-count").value;
    let maxNumberInput = document.querySelector("#max-number-count").value;

    minNumber = document.querySelector("#min-number-count").value;
    maxNumber = document.querySelector("#max-number-count").value;

    if (minNumberInput.replace(/\s/g, '').length === 0 || isNaN(minNumberInput)) {
        minNumber = 1;
        alert("Вы ввели не число, будет сгенерировано число от 1.");
    }
    if (maxNumberInput.replace(/\s/g, '').length === 0 || isNaN(maxNumberInput)) {
        maxNumber = 10;
        alert("Вы ввели не число, будет сгенерировано число до 10.");
    }

    passwd += getRandomIntInclusive(minNumber, maxNumber);
    document.querySelector("#passwords").innerHTML = "<p>" + passwd + "</p>";
    
}